{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 32, "data_format": "channels_last", "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "padding": "valid", "batch_input_shape": [null, 64, 64, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "filters": 32, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 128, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "units": 3, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null}}]}